<?php include('bloks/Head.html');
include('bloks/Menu.html'); ?>
<!-- content -->
<br><h1>Модуль 6</h1>
<h2>Задание №6-3</h2>
<h3>Создайте галерею фотографий. <br>
Требования: <br>
1. Возможность загрузки фотографии на сервер (при загрузке должен проверяться тип файла);<br>
2. Загруженная фотография помещается в новый каталог gallery;<br>
3. Вывод на экран всех загруженных фотографий;<br><br>
Дополнительно (дополнительные баллы):<br>
4. При загрузке должна автоматически создаваться ее уменьшенная копия (не более 200 пикселей по наибольшей стороне) – найти решение в Интернете;<br>
5. Для хранения файлов используется два каталога – один для маленьких изображений, другой – для больших;<br>
6. Возможность просмотра уменьшенных фотографий (все на одной странице);<br>
7. Возможность увеличения фотографии при клике по ней (переход на отдельную страницу); <br>
<br><br></h3>

<?php

 ?>
<!-- content -->
<?php include('bloks/Footer.html'); ?>
